In [2]:
%load_ext sql

Connect to the empty database made with pgadmin

In [3]:
%sql postgresql://postgres:eric@localhost:5432/analysis

'Connected: postgres@analysis'

### CREATE
Lets add some data to the table

In [3]:
%%sql
CREATE TABLE teachers (
    id bigserial,
    first_name varchar(25),
    last_name varchar(50),
    school varchar(50),
    hire_date date,
    slary numeric
);

 * postgresql://postgres:***@localhost:5432/analysis
Done.

[]

In [4]:
%sql DROP TABLE teachers;

 * postgresql://postgres:***@localhost:5432/analysis
Done.

[]

In [5]:
%%sql
CREATE TABLE teachers (
    id bigserial,
    first_name varchar(25),
    last_name varchar(50),
    school varchar(50),
    hire_date date,
    salary numeric
);

 * postgresql://postgres:***@localhost:5432/analysis
Done.

[]

### INSERT
Insert some data into teachers table

In [6]:
%%sql 
INSERT INTO teachers(first_name, last_name, school, hire_date, salary)
VALUES ('Janet', 'Smith', 'F.D. Roosevelt HS', '2011-10-30', 36200),
       ('Lee', 'Reynolds', 'F.D. Roosevelt HS', '1993-05-22', 65000),
       ('Samuel', 'Cole', 'Myers Middle School', '2005-08-01', 43500),
       ('Samantha', 'Bush', 'Myers Middle School', '2011-10-30', 36200),
       ('Betty', 'Diaz', 'Myers Middle School', '2005-08-30', 43500),
       ('Kathleen', 'Roush', 'F.D. Roosevelt HS', '2010-10-22', 38500);

 * postgresql://postgres:***@localhost:5432/analysis
6 rows affected.

[]

### Querying Data

In [7]:
%sql select * from teachers

 * postgresql://postgres:***@localhost:5432/analysis
6 rows affected.

[(1, 'Janet', 'Smith', 'F.D. Roosevelt HS', datetime.date(2011, 10, 30), Decimal('36200')),
 (2, 'Lee', 'Reynolds', 'F.D. Roosevelt HS', datetime.date(1993, 5, 22), Decimal('65000')),
 (3, 'Samuel', 'Cole', 'Myers Middle School', datetime.date(2005, 8, 1), Decimal('43500')),
 (4, 'Samantha', 'Bush', 'Myers Middle School', datetime.date(2011, 10, 30), Decimal('36200')),
 (5, 'Betty', 'Diaz', 'Myers Middle School', datetime.date(2005, 8, 30), Decimal('43500')),
 (6, 'Kathleen', 'Roush', 'F.D. Roosevelt HS', datetime.date(2010, 10, 22), Decimal('38500'))]

In [8]:
%sql SELECT first_name, last_name from teachers;

 * postgresql://postgres:***@localhost:5432/analysis
6 rows affected.

[('Janet', 'Smith'),
 ('Lee', 'Reynolds'),
 ('Samuel', 'Cole'),
 ('Samantha', 'Bush'),
 ('Betty', 'Diaz'),
 ('Kathleen', 'Roush')]

In [9]:
%sql SELECT DISTINCT school,salary from teachers;

 * postgresql://postgres:***@localhost:5432/analysis
5 rows affected.

[('Myers Middle School', Decimal('36200')),
 ('F.D. Roosevelt HS', Decimal('65000')),
 ('Myers Middle School', Decimal('43500')),
 ('F.D. Roosevelt HS', Decimal('38500')),
 ('F.D. Roosevelt HS', Decimal('36200'))]

sort by salary

In [13]:
%%sql 
SELECT first_name, last_name, salary 
FROM teachers
ORDER BY salary desc

 * postgresql://postgres:***@localhost:5432/analysis
6 rows affected.

[('Lee', 'Reynolds', Decimal('65000')),
 ('Samuel', 'Cole', Decimal('43500')),
 ('Betty', 'Diaz', Decimal('43500')),
 ('Kathleen', 'Roush', Decimal('38500')),
 ('Janet', 'Smith', Decimal('36200')),
 ('Samantha', 'Bush', Decimal('36200'))]

In [14]:
%%sql
SELECT last_name, school, hire_date
FROM teachers
WHERE school != 'Myers Middle School'

 * postgresql://postgres:***@localhost:5432/analysis
3 rows affected.

[('Smith', 'F.D. Roosevelt HS', datetime.date(2011, 10, 30)),
 ('Reynolds', 'F.D. Roosevelt HS', datetime.date(1993, 5, 22)),
 ('Roush', 'F.D. Roosevelt HS', datetime.date(2010, 10, 22))]

In [16]:
%%sql
SELECT first_name, last_name, salary
FROM teachers
WHERE salary BETWEEN 40000 and 65000;

 * postgresql://postgres:***@localhost:5432/analysis
3 rows affected.

[('Lee', 'Reynolds', Decimal('65000')),
 ('Samuel', 'Cole', Decimal('43500')),
 ('Betty', 'Diaz', Decimal('43500'))]

In [17]:
%%sql
SELECT first_name
FROM teachers
WHERE first_name LIKE 'sam%'

 * postgresql://postgres:***@localhost:5432/analysis
0 rows affected.

[]

In [25]:
%%sql
/*using case insensitive*/
SELECT first_name
FROM teachers
WHERE first_name ILIKE 'sam%'

 * postgresql://postgres:***@localhost:5432/analysis
2 rows affected.

[('Samuel',), ('Samantha',)]

In [27]:
%%sql
/* schools in alpha order along with teachers*/
SELECT school, first_name, last_name
FROM teachers
ORDER BY school, last_name

 * postgresql://postgres:***@localhost:5432/analysis
6 rows affected.

[('F.D. Roosevelt HS', 'Lee', 'Reynolds'),
 ('F.D. Roosevelt HS', 'Kathleen', 'Roush'),
 ('F.D. Roosevelt HS', 'Janet', 'Smith'),
 ('Myers Middle School', 'Samantha', 'Bush'),
 ('Myers Middle School', 'Samuel', 'Cole'),
 ('Myers Middle School', 'Betty', 'Diaz')]

First name starts with S and earns more than 40000

In [30]:
%%sql
SELECT first_name, last_name, salary FROM teachers
WHERE first_name ILIKE 's%' AND salary > 40000

 * postgresql://postgres:***@localhost:5432/analysis
1 rows affected.

[('Samuel', 'Cole', Decimal('43500'))]

Rank teachers hired since jan 1, 2010 ordered by highest to lowest pay

In [32]:
%%sql
SELECT first_name, last_name, salary, hire_date FROM teachers
WHERE hire_date > '1-1-2010'
ORDER BY salary desc

 * postgresql://postgres:***@localhost:5432/analysis
3 rows affected.

[('Kathleen', 'Roush', Decimal('38500'), datetime.date(2010, 10, 22)),
 ('Janet', 'Smith', Decimal('36200'), datetime.date(2011, 10, 30)),
 ('Samantha', 'Bush', Decimal('36200'), datetime.date(2011, 10, 30))]

In [55]:
#ls

### Datatypes

In [34]:
%%sql
CREATE TABLE char_data_types (
    varchar_column varchar(10),
    char_column char(10),
    text_column text
);
INSERT INTO char_data_types
VALUES ('abc','abc','abc'),
       ('defghi','defghi','defghi')

 * postgresql://postgres:***@localhost:5432/analysis
Done.
2 rows affected.

[]

look at data

In [41]:
%%sql 
COPY char_data_types TO 'D:\\ml_code\\data_science\\sql\\typetest.txt'
WITH (FORMAT CSV, HEADER, DELIMITER '|');

 * postgresql://postgres:***@localhost:5432/analysis
2 rows affected.

[]

In [53]:
#%sql DROP TABLE number_data_types;

 * postgresql://postgres:***@localhost:5432/analysis
Done.

[]

In [54]:
%%sql
CREATE TABLE number_data_types (
    numeric_column numeric(20,5),
    real_column real,
    double_column double precision
);
INSERT INTO number_data_types
VALUES (.7,.7,.7),
       (2.13579, 2.13579, 2.13579),
       (2.1357887654, 2.1357887654, 2.1357887654 );

SELECT * FROM number_data_types;

 * postgresql://postgres:***@localhost:5432/analysis
Done.
3 rows affected.
3 rows affected.

[(Decimal('0.70000'), 0.7, 0.7),
 (Decimal('2.13579'), 2.13579, 2.13579),
 (Decimal('2.13579'), 2.13579, 2.1357887654)]

### Datetimes
Looking at different formats.  Insert times and then a timezone, also use psql now() function

In [5]:
%%sql
CREATE TABLE date_time_types (
    timestamp_column timestamp with time zone,
    interval_column interval
);
INSERT INTO date_time_types
VALUES
    ('2018-12-31 01:00 EST', '2 days'),
    ('2018-12-31 01:00 -8', '1 month'),
    ('2018-12-31 01:00 Australia/Melbourne','1 century'),
    (now(), '1 week')

 * postgresql://postgres:***@localhost:5432/analysis
Done.
4 rows affected.

[]

In [6]:
%sql select * FROM date_time_types;

 * postgresql://postgres:***@localhost:5432/analysis
4 rows affected.

[(datetime.datetime(2018, 12, 31, 6, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), datetime.timedelta(2)),
 (datetime.datetime(2018, 12, 31, 9, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), datetime.timedelta(30)),
 (datetime.datetime(2018, 12, 30, 14, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), datetime.timedelta(36500)),
 (datetime.datetime(2019, 9, 17, 6, 10, 35, 938875, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), datetime.timedelta(7))]

### Using the interval datatype

In [7]:
%sql SELECT timestamp_column, interval_column, timestamp_column - interval_column AS new_date FROM date_time_types;

 * postgresql://postgres:***@localhost:5432/analysis
4 rows affected.

[(datetime.datetime(2018, 12, 31, 6, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), datetime.timedelta(2), datetime.datetime(2018, 12, 29, 6, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (datetime.datetime(2018, 12, 31, 9, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), datetime.timedelta(30), datetime.datetime(2018, 11, 30, 9, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (datetime.datetime(2018, 12, 30, 14, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), datetime.timedelta(36500), datetime.datetime(1918, 12, 30, 14, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (datetime.datetime(2019, 9, 17, 6, 10, 35, 938875, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), datetime.timedelta(7), datetime.datetime(2019, 9, 10, 6, 10, 35, 938875, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)))]

### Using Casts

In [9]:
%sql select timestamp_column, CAST(timestamp_column AS varchar(10)) from date_time_types;

 * postgresql://postgres:***@localhost:5432/analysis
4 rows affected.

[(datetime.datetime(2018, 12, 31, 6, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), '2018-12-31'),
 (datetime.datetime(2018, 12, 31, 9, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), '2018-12-31'),
 (datetime.datetime(2018, 12, 30, 14, 0, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), '2018-12-30'),
 (datetime.datetime(2019, 9, 17, 6, 10, 35, 938875, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=60, name=None)), '2019-09-17')]

In [13]:
%%sql
select numeric_column, CAST(numeric_column as integer),
    CAST(numeric_column AS varchar(6))
    from number_data_types

 * postgresql://postgres:***@localhost:5432/analysis
3 rows affected.

[(Decimal('0.70000'), 1, '0.7000'),
 (Decimal('2.13579'), 2, '2.1357'),
 (Decimal('2.13579'), 2, '2.1357')]